In [17]:
import numpy as np
import pandas as pd

In [18]:
from numpy.random import randn

In [19]:
np.random.seed(101)

In [21]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

AttributeError: module 'pandas' has no attribute 'DataFrame'

In [7]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [8]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [9]:
type(df['W'])

pandas.core.series.Series

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [15]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [16]:
df['new'] = df['W'] + df['Y']

In [17]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [22]:
df.drop('new',axis = 1,inplace = True)

In [23]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [24]:
df.drop('E',axis = 0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [25]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [26]:
df.drop('E',axis = 0, inplace = True)

In [27]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [28]:
df.shape

(4, 4)

In [30]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [31]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [34]:
df.loc['B':,:'Z']

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [35]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

In [ ]:
from numpy.random import randn

In [7]:
import numpy as np
import pandas as pd

In [8]:
data = {'Company': ['GOOG','GOOG', 'MSFT', 'MSFT','FB','FB'],
'Person' : ['Sam', 'Charlie','Amy', 'Vanessa', 'Carl', 'Sarah'],
'Sales' : [20,120,340,124,243,350]}

In [9]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [20, 120, 340, 124, 243, 350]}

In [ ]:
pd.D

In [12]:
df = pd.DataFrame(data,index=[1,2,3,4,5,6])

AttributeError: module 'pandas' has no attribute 'DataFrame'

In [11]:
df

NameError: name 'df' is not defined

In [13]:
byComp = df.groupby('Company')

In [15]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG      70.0
MSFT     232.0

In [16]:
byComp.sum()

         Sales
Company
FB         593
GOOG       140
MSFT       464

In [17]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      70.710678
MSFT     152.735065

In [19]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [26]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [27]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [29]:
byComp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie     20
MSFT         Amy    124

In [30]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0   70.0   70.710678   20.0   45.00   70.0   95.00  120.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [31]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000   70.000000  232.000000
      std     75.660426   70.710678  152.735065
      min    243.000000   20.000000  124.000000
      25%    269.750000   45.000000  178.000000
      50%    296.500000   70.000000  232.000000
      75%    323.250000   95.000000  286.000000
      max    350.000000  120.000000  340.000000

In [32]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [37]:
import numpy as np
import pandas as pd

In [42]:
df = pd.DataFrame({'col1' : [1,2,3,4],
'col2' : [444,555,666,444],
'col3' : ['abc','def','ghi','xyz']})

In [43]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [44]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [46]:
df['col2'].unique()

array([444, 555, 666])

In [47]:
df['col2'].nunique()

3

In [48]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [50]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [54]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [55]:
def times2(x) :
    return x*2

In [56]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [57]:
df['col3'].apply(times2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [58]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [59]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [60]:
df.drop('col1',axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [61]:
df.drop('col1',axis = 1, inplace = True)

In [62]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [63]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [68]:
df.sort_values(by = 'col2',ascending=False )

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz

In [69]:
import pandas as pd

In [70]:
pwd

'/Users/ceyhun/Desktop/CALISMALARIM/DATA Science/PANDAS_Calisma'

In [71]:
import pandas as pd

In [77]:
sal = pd.read_csv('Salaries.csv')

In [105]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011.0,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011.0,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011.0,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011.0,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011.0,NaN,San Francisco,NaN

In [79]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120460 entries, 0 to 120459
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                120460 non-null  int64
 1   EmployeeName      120460 non-null  object
 2   JobTitle          120460 non-null  object
 3   BasePay           119855 non-null  float64
 4   OvertimePay       120460 non-null  float64
 5   OtherPay          120460 non-null  float64
 6   Benefits          84301 non-null   float64
 7   TotalPay          120460 non-null  float64
 8   TotalPayBenefits  120459 non-null  float64
 9   Year              120459 non-null  float64
 10  Notes             0 non-null       float64
 11  Agency            120459 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(9), int64(1), object(3)
memory usage: 11.9+ MB

In [86]:
sal['BasePay'].mean()

70816.76153436908

In [88]:
sal['OvertimePay'].max()

245131.88

In [92]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [94]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [106]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011.0,NaN,San Francisco,NaN

In [108]:
sal.groupby('Year').mean()['BasePay']

Year
2011.0     63595.956517
2012.0     65436.406857
2013.0     69630.030216
2014.0    121460.164551
Name: BasePay, dtype: float64

In [109]:
sal['JobTitle'].value_counts().head(5)

Transit Operator    4674
Registered Nurse    3413
Special Nurse       2937
TRANSIT OPERATOR    2388
Police Officer 3    2318
Name: JobTitle, dtype: int64

In [110]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts()==1)

202

In [111]:
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False

In [112]:
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

598

In [113]:
sal['title_len'] = sal['JobTitle'].apply(len)

In [114]:
sal[['title_len','TotalPayBenefits']].corr() # No correlation.

                  title_len  TotalPayBenefits
title_len          1.000000         -0.053008
TotalPayBenefits  -0.053008          1.000000